// 2024年节假日数据
// 格式: 'YYYY-MM-DD': '节假日名称'

class Holidays {
  static final Map<String, String> holidays2024 = {
    '2024-01-01': '元旦',
    '2024-02-10': '春节',
    '2024-02-11': '春节',
    '2024-02-12': '春节',
    '2024-02-13': '春节',
    '2024-02-14': '春节',
    '2024-02-15': '春节',
    '2024-02-16': '春节',
    '2024-02-17': '春节',
    '2024-04-04': '清明节',
    '2024-04-05': '清明节',
    '2024-04-06': '清明节',
    '2024-05-01': '劳动节',
    '2024-05-02': '劳动节',
    '2024-05-03': '劳动节',
    '2024-05-04': '劳动节',
    '2024-05-05': '劳动节',
    '2024-06-10': '端午节',
    '2024-09-15': '中秋节',
    '2024-09-16': '中秋节',
    '2024-09-17': '中秋节',
    '2024-10-01': '国庆节',
    '2024-10-02': '国庆节',
    '2024-10-03': '国庆节',
    '2024-10-04': '国庆节',
    '2024-10-05': '国庆节',
    '2024-10-06': '国庆节',
    '2024-10-07': '国庆节',
  };
  
  static final Map<String, String> holidays2025 = {
    '2025-01-01': '元旦',
    '2025-01-29': '春节',
    '2025-01-30': '春节',
    '2025-01-31': '春节',
    '2025-02-01': '春节',
    '2025-02-02': '春节',
    '2025-02-03': '春节',
    '2025-02-04': '春节',
    '2025-04-04': '清明节',
    '2025-04-05': '清明节',
    '2025-04-06': '清明节',
    '2025-05-01': '劳动节',
    '2025-05-02': '劳动节',
    '2025-05-03': '劳动节',
    '2025-05-04': '劳动节',
    '2025-05-05': '劳动节',
    '2025-05-31': '端午节',
    '2025-06-01': '端午节',
    '2025-06-02': '端午节',
    '2025-10-01': '国庆节',
    '2025-10-02': '国庆节',
    '2025-10-03': '国庆节',
    '2025-10-04': '国庆节',
    '2025-10-05': '国庆节',
    '2025-10-06': '国庆节',
    '2025-10-07': '国庆节',
    '2025-10-08': '国庆节',
  };
  
  static bool isHoliday(DateTime date) {
    final String dateStr = '${date.year}-${date.month.toString().padLeft(2, '0')}-${date.day.toString().padLeft(2, '0')}';
    
    if (date.year == 2024) {
      return holidays2024.containsKey(dateStr);
    } else if (date.year == 2025) {
      return holidays2025.containsKey(dateStr);
    }
    
    // 默认不是节假日
    return false;
  }
  
  static String getHolidayName(DateTime date) {
    final String dateStr = '${date.year}-${date.month.toString().padLeft(2, '0')}-${date.day.toString().padLeft(2, '0')}';
    
    if (date.year == 2024) {
      return holidays2024[dateStr] ?? '';
    } else if (date.year == 2025) {
      return holidays2025[dateStr] ?? '';
    }
    
    // 默认返回空字符串
    return '';
  }
}